papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/perpendicularFlap/base/partitioned/0/fluid/U.partitioned
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    flap
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    upperWall
    {
        // Can be used in openfoam but not available in foam extend
        //type            noSlip;

        // Can be used in all versions
        type              fixedValue;
        value             uniform (0 0 0);
    }
    lowerWall
    {
        // Can be used in openfoam but not available in foam extend
        //type            noSlip;

        // Can be used in all versions
        type              fixedValue;
        value             uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}
