papers/JFNK_quasi_monolithic_FSI/fluidSolidInteraction/perpendicularFlap/base/partitioned/system/solid/blockMeshDict.3
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.3                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 0.01;

vertices
(
    (-5 0 0)
    (5 0 0)
    (5 100 0)
    (-5 100 0)

    (-5 0 100)
    (5 0 100)
    (5 100 100)
    (-5 100 100)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (12 60 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch interface
    (
        (4 7 3 0)
        (7 6 2 3)
        (1 2 6 5)
    )
    patch bottom
    (
        (0 1 5 4)
    )
    empty frontAndBack
    (
        (3 2 1 0)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
